Reports/АР17_РеестрДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>АР17_РеестрДоговоров</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/АР_СобственникиОбъектовАренды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_СобственникиОбъектовАренды</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АгентскаяСхема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/АР_СтатусДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>АР_СтатусДоговора</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписанСкан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/АР_АктПриемаПередачиПомещенияВАренду.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>АР_АктПриемаПередачиПомещенияВАренду</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеДоговораАренды</xr:Item>
				<xr:Item>Document.АР17_ДополнительноеСоглашение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АР_ПереданныеДокументы</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>InformationRegister.АР_СтатусыОбъектовНедвижимости</xr:Item>
				<xr:Item>InformationRegister.АР_СостояниеОбъектов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация-арендодатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПроводки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчетаБУ</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Передан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_Москва</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АР_СанктПетербург</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СтатусДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/АР17_РеестрДоговоров/Ext/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ТабРезультат = Новый ТаблицаЗначений;
    КЧ = Новый КвалификаторыЧисла(12,2);
    КД = Новый КвалификаторыДаты(ЧастиДаты.Дата);
    КС = Новый КвалификаторыСтроки(20);
    Массив = Новый Массив;
    Массив.Добавить(Тип("Число"));
    ОписаниеТиповЧ = Новый ОписаниеТипов(Массив, , ,КЧ);
    Массив.Очистить();
    Массив.Добавить(Тип("Дата"));
    ОписаниеТиповД = Новый ОписаниеТипов(Массив, , ,КД);
	Массив.Очистить();
	Массив.Добавить(Тип("Строка"));
    ОписаниеТиповС = Новый ОписаниеТипов(Массив, , КС);
	ТабРезультат.Колонки.Добавить("ОбеспечительныйВзнос",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Ставка",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Контрагент",Новый описаниеТипов("СправочникСсылка.Контрагенты"));
	ТабРезультат.Колонки.Добавить("Договор",Новый описаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	ТабРезультат.Колонки.Добавить("ДатаОкончанияСрокаАренды", ОписаниеТиповД);
	ТабРезультат.Колонки.Добавить("ДатаНачалаСрокаАренды", ОписаниеТиповД);    
	ТабРезультат.Колонки.Добавить("ДатаАкта", ОписаниеТиповД);           
	//ТабРезультат.Колонки.Добавить("Организация",Новый описаниеТипов("СправочникСсылка.Организации"));
	ТабРезультат.Колонки.Добавить("ВидДоговора",Новый описаниеТипов("СправочникСсылка.АР_ВидыДоговоров"));
	ТабРезультат.Колонки.Добавить("Комментарий",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ПлощадьПоДоговору",ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("Номенклатура",Новый описаниеТипов("СправочникСсылка.Номенклатура"));
	ТабРезультат.Колонки.Добавить("Этаж",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Офис",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Помещение",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Здание",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Объект",Новый описаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Валюта",Новый описаниеТипов("СправочникСсылка.Валюты"));
	ТабРезультат.Колонки.Добавить("СтоимостьПоНоменклатуре", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("РазмерПоБТИ", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("РазмерПоБома", ОписаниеТиповЧ);
	ТабРезультат.Колонки.Добавить("НазваниеБренд",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("НомерПоПлану", ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ИК",Новый ОписаниеТипов("СправочникСсылка.АР_ОбъектыАренды"));
	ТабРезультат.Колонки.Добавить("Профиль",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ОдностороннееРасторжениеСоСтороныАрендодателя",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ОдностороннееРасторжениеСоСтороныАрендатора",ОписаниеТиповС);
	//ТабРезультат.Колонки.Добавить("Арендодатель",Новый описаниеТипов("СправочникСсылка.Контрагенты"));
	ТабРезультат.Колонки.Добавить("Организация",Новый описаниеТипов("СправочникСсылка.Организации"));
	ТабРезультат.Колонки.Добавить("Индексация",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("USD",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ЦенаКвМГод",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("Номер",ОписаниеТиповС);
	ТабРезультат.Колонки.Добавить("ФактическоеНачало", ОписаниеТиповД);
	ТабРезультат.Колонки.Добавить("ФактическоеОкончание", ОписаниеТиповД);    
	
	ТабРезультат.Колонки.Добавить("Ссылка",Новый описаниеТипов("ДокументСсылка.АР17_ЗаключениеДоговораАренды"));
	ТабРезультат.Колонки.Добавить("СуммаЗалога", ОписаниеТиповЧ);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВложенныйЗапрос.ДокументДата) КАК ДокументДата,
		|	ВложенныйЗапрос.ДокументСсылка,
		|	ВложенныйЗапрос.Ссылка,
		|	МАКСИМУМ(ВложенныйЗапрос.СуммаЗалога) КАК СуммаЗалога,
		|	ВложенныйЗапрос.ОбщаяПлощадь
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Документ.Дата) КАК ДокументДата,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Документ.Ссылка КАК ДокументСсылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка КАК Ссылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеНачало КАК ФактическоеНачало,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание КАК ФактическоеОкончание,
		|		NULL КАК СуммаЗалога,
		|		NULL КАК ОбщаяПлощадь
		|	ИЗ
		|		Документ.АР17_ЗаключениеДоговораАренды.ДополнительныеСоглашения КАК АР_ЗаключениеДоговораАрендыДополнительныеСоглашения
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &Статус <> ""Закрытые""
		|						И &Статус <> ""Текущие""
		|					ТОГДА АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &Статус = ""Закрытые""
		|							ТОГДА АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание <= &ДатаКон
		|									И АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание >= &ДатаНач
		|						ИНАЧЕ ВЫБОР
		|								КОГДА &Статус = ""Текущие""
		|									ТОГДА (АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание >= &ДатаКон
		|											ИЛИ АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1))
		|											И АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Документ.Ссылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеНачало,
		|		АР_ЗаключениеДоговораАрендыДополнительныеСоглашения.Ссылка.ФактическоеОкончание
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		АР_ЗаключениеДоговораАренды.Дата,
		|		АР_ЗаключениеДоговораАренды.Ссылка,
		|		АР_ЗаключениеДоговораАренды.Ссылка,
		|		АР_ЗаключениеДоговораАренды.ФактическоеНачало,
		|		АР_ЗаключениеДоговораАренды.ФактическоеОкончание,
		|		АР_ЗаключениеДоговораАренды.СуммаЗалога,
		|		АР_ЗаключениеДоговораАренды.ОбщаяПлощадь
		|	ИЗ
		|		Документ.АР17_ЗаключениеДоговораАренды КАК АР_ЗаключениеДоговораАренды
		|	ГДЕ
		|		ВЫБОР
		|				КОГДА &Статус <> ""Закрытые""
		|						И &Статус <> ""Текущие""
		|					ТОГДА АР_ЗаключениеДоговораАренды.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|				ИНАЧЕ ВЫБОР
		|						КОГДА &Статус = ""Закрытые""
		|							ТОГДА АР_ЗаключениеДоговораАренды.Ссылка.ФактическоеОкончание <= &ДатаКон
		|									И АР_ЗаключениеДоговораАренды.Ссылка.ФактическоеОкончание >= &ДатаНач
		|						ИНАЧЕ ВЫБОР
		|								КОГДА &Статус = ""Текущие""
		|									ТОГДА (АР_ЗаключениеДоговораАренды.Ссылка.ФактическоеОкончание >= &ДатаКон
		|											ИЛИ АР_ЗаключениеДоговораАренды.Ссылка.ФактическоеОкончание = ДАТАВРЕМЯ(1, 1, 1))
		|											И АР_ЗаключениеДоговораАренды.Ссылка.СтатусДоговора = ЗНАЧЕНИЕ(Перечисление.АР_СтатусДоговора.Согласован)
		|							КОНЕЦ
		|					КОНЕЦ
		|			КОНЕЦ) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ДокументСсылка,
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.ОбщаяПлощадь";
	
	КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	Настройки = КомпоновщикНастроек.Настройки; 
	 
	НачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаНачала"));
	КонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаКонца"));
	Статус = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Статус"));
	Запрос.УстановитьПараметр("ДатаНач",Дата(НачалоПериода.Значение));
	Запрос.УстановитьПараметр("ДатаКон",Дата(КонецПериода.Значение));
	Если Статус.Использование Тогда
		Запрос.УстановитьПараметр("Статус",Статус.Значение);
	Иначе
		Запрос.УстановитьПараметр("Статус","");
	КонецЕсли;	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//ОбработкаПрерыванияПользователя();
	Если ТипЗнч(ВыборкаДетальныеЗаписи.ДокументСсылка) = Тип("ДокументСсылка.АР17_ЗаключениеДоговораАренды") Тогда
		ПутьКИК = "";
	Иначе
		ПутьКИК = ".ДокументОснование";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ОбъектАренды,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Услуга,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Количество,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ставка,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало КАК ФактическоеНачало,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание КАК ФактическоеОкончание,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ИК КАК ИК,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.СуммаЗалога КАК СуммаЗалога,
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка.ОбщаяПлощадь
	|ПОМЕСТИТЬ ТабДоговоров
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ПостояннаяЧастьАренднойПлаты КАК ПоследнийДокПостояннаяЧастьАренднойПлаты
	|ГДЕ
	|	ПоследнийДокПостояннаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ОбъектАренды,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Услуга,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Количество,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ставка,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаНачалаСрокаАренды,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.ДатаОкончанияСрокаАренды,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеНачало,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ФактическоеОкончание,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ИК,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.СуммаЗалога,
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка.ОбщаяПлощадь
	|ИЗ
	|	Документ.АР17_ЗаключениеДоговораАренды.ПеременнаяЧастьАренднойПлаты КАК ПоследнийДокПеременнаяЧастьАренднойПлаты
	|ГДЕ
	|	ПоследнийДокПеременнаяЧастьАренднойПлаты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабДоговоров.Ссылка.Организация КАК Организация,
	|	ТабДоговоров.Ссылка.Контрагент КАК Контрагент,
	|	ТабДоговоров.Ссылка.ДоговорКонтрагента КАК Договор,
	|	ТабДоговоров.ОбщаяПлощадь КАК ПлощадьПоДоговору,
	|	АР_АктПриемаПередачиПомещенияВАренду.Дата КАК ДатаАкта,
	|	ТабДоговоров.Услуга КАК Номенклатура,
	|	ТабДоговоров.Количество,
	|	ТабДоговоров.Ставка,
	|	(ВЫРАЗИТЬ(ТабДоговоров.Ставка КАК ЧИСЛО(15, 2))) * (ВЫРАЗИТЬ(ТабДоговоров.Количество КАК ЧИСЛО(15, 2))) КАК СтоимостьПоНоменклатуре,
	|	ТабДоговоров.Ссылка,
	|	ТабДоговоров.ДатаНачалаСрокаАренды,
	|	ТабДоговоров.ДатаОкончанияСрокаАренды,
	|	ТабДоговоров.Ссылка.Комментарий КАК Комментарий,
	|	ТабДоговоров.Ссылка.ВидДоговора КАК ВидДоговора,
	|	ТабДоговоров.ИК,
	|	ТабДоговоров.СуммаЗалога,
	|	"""" КАК НазваниеБренд,
	|	"""" КАК Профиль,
	|	ТабДоговоров.Ссылка.СуммаЗалога КАК ОбеспечительныйВзнос,
	|	ТабДоговоров.Ссылка.ВалютаДепозита КАК Валюта,
	|	"""" КАК ОдностороннееРасторжениеСоСтороныАрендатора,
	|	"""" КАК USD,
	|	"""" КАК Индексация,
	|	"""" КАК ЦенаКвМГод,
	|	ТабДоговоров.ФактическоеНачало КАК ФактическоеНачало,
	|	ТабДоговоров.ФактическоеОкончание КАК ФактическоеОкончание,
	|	"""" КАК ОдностороннееРасторжениеСоСтороныАрендодателя,
	|	ТабДоговоров.Ссылка.Номер КАК Номер
	|ИЗ
	|	ТабДоговоров КАК ТабДоговоров
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АР_АктПриемаПередачиПомещенияВАренду КАК АР_АктПриемаПередачиПомещенияВАренду
	|		ПО ТабДоговоров.Ссылка.ДоговорКонтрагента = АР_АктПриемаПередачиПомещенияВАренду.ДоговорКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АР_СобственникиОбъектовАренды.СрезПоследних КАК АР_СобственникиОбъектовАрендыСрезПоследних
	|		ПО ТабДоговоров.ОбъектАренды = АР_СобственникиОбъектовАрендыСрезПоследних.ОбъектАренды
	|
	|УПОРЯДОЧИТЬ ПО
	|	Контрагент,
	|	ДатаАкта";
	
	Запрос.УстановитьПараметр("Ссылка", ВыборкаДетальныеЗаписи.ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		НовСтрока=ТабРезультат.Добавить();
		НовСтрока.ОбеспечительныйВзнос=РезультатЗапроса.ОбеспечительныйВзнос;
		НовСтрока.Ставка=РезультатЗапроса.Ставка;
		НовСтрока.Контрагент=РезультатЗапроса.Контрагент;
		НовСтрока.Договор=РезультатЗапроса.Договор;
		НовСтрока.ДатаОкончанияСрокаАренды=РезультатЗапроса.ДатаОкончанияСрокаАренды;
		НовСтрока.ДатаНачалаСрокаАренды=РезультатЗапроса.ДатаНачалаСрокаАренды;    
		НовСтрока.ДатаАкта=РезультатЗапроса.ДатаАкта;           
		//НовСтрока.Организация=РезультатЗапроса.Организация;
		НовСтрока.ВидДоговора=РезультатЗапроса.ВидДоговора;
		НовСтрока.Комментарий=РезультатЗапроса.Комментарий;
		НовСтрока.ПлощадьПоДоговору=РезультатЗапроса.ПлощадьПоДоговору;
		НовСтрока.Номенклатура=РезультатЗапроса.Номенклатура;
		//НовСтрока.Этаж=РезультатЗапроса.Этаж;
		//НовСтрока.Офис=РезультатЗапроса.Офис;
		//НовСтрока.Помещение=РезультатЗапроса.Помещение;
		//НовСтрока.Объект=РезультатЗапроса.Объект;
		НовСтрока.Валюта=РезультатЗапроса.Валюта;
		НовСтрока.СтоимостьПоНоменклатуре=РезультатЗапроса.СтоимостьПоНоменклатуре;
		//НовСтрока.РазмерПоБТИ=РезультатЗапроса.РазмерПоБТИ;
		//НовСтрока.РазмерПоБома=РезультатЗапроса.РазмерПоБома;
		НовСтрока.НазваниеБренд=РезультатЗапроса.НазваниеБренд;
		//НовСтрока.НомерПоПлану=РезультатЗапроса.НомерПоПлану;
		НовСтрока.ИК=РезультатЗапроса.ИК;
		НовСтрока.Профиль=РезультатЗапроса.Профиль;
		НовСтрока.ОдностороннееРасторжениеСоСтороныАрендодателя=РезультатЗапроса.ОдностороннееРасторжениеСоСтороныАрендодателя;
		НовСтрока.ОдностороннееРасторжениеСоСтороныАрендатора=РезультатЗапроса.ОдностороннееРасторжениеСоСтороныАрендатора;
		НовСтрока.Организация=РезультатЗапроса.Организация;
		НовСтрока.Индексация=РезультатЗапроса.Индексация;
		НовСтрока.USD=РезультатЗапроса.USD;
		НовСтрока.ЦенаКвМГод=РезультатЗапроса.ЦенаКвМГод;
		НовСтрока.Номер=РезультатЗапроса.Номер;
		НовСтрока.Ссылка=РезультатЗапроса.Ссылка;
		НовСтрока.ФактическоеНачало=РезультатЗапроса.ФактическоеНачало;
		НовСтрока.ФактическоеОкончание=РезультатЗапроса.ФактическоеОкончание;
		
		НовСтрока.СуммаЗалога=РезультатЗапроса.СуммаЗалога;
	КонецЦикла;	

	КонецЦикла;
	
    ВнешниеНаборыДанных = Новый Структура; 
    ВнешниеНаборыДанных.Вставить("РеестрДоговоров", ТабРезультат); 

	//Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода"));; 
	//Параметр.Значение = ДатаНачала; 
	//Параметр.Использование = Истина; 
	//Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("КонецПериода"));; 
	//Параметр.Значение = ДатаКонца; 
	//Параметр.Использование = Истина; 
	//Параметр = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));; 
	//Параметр.Значение = Организация; 
	//Параметр.Использование = Истина; 
	
	СтандартнаяОбработка = Ложь;
    
     КомпоновщикНастроек.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
     Настройки = КомпоновщикНастроек.Настройки; 
	 
 	 ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
    
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
    ДокументРезультат.Очистить();
    
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);   
КонецПроцедуры

Функция СведенияОВнешнейОбработке() Экспорт
	
    ПараметрыРегистрации = Новый Структура;

    МассивНазначений = Новый Массив;
    
    // Первый параметр, который мы должны указать - это какой вид обработки системе должна зарегистрировать. 
    // Допустимые типы: ДополнительнаяОбработка, ДополнительныйОтчет, ЗаполнениеОбъекта, Отчет, ПечатнаяФорма, СозданиеСвязанныхОбъектов
    ПараметрыРегистрации.Вставить("Вид", "ДополнительныйОтчет");

    ПараметрыРегистрации.Вставить("Назначение", МассивНазначений);
    
    // Теперь зададим имя, под которым отчёт будет зарегистрирован в справочнике внешних обработок
    ПараметрыРегистрации.Вставить("Наименование", "Отчет по счетам и платежам аренды");
    
    // Зададим право обработке на использование безопасного режима. Более подробно можно узнать в справке к платформе (метод УстановитьБезопасныйРежим)
    ПараметрыРегистрации.Вставить("БезопасныйРежим", Истина);

    // Пробуем задать здесь "РазделениеВключено"
	// Не "взлетело"
	//ПараметрыРегистрации.Вставить("РазделениВключено", Истина);

    // Следующие два параметра играют больше информационную роль, т.е. это то, что будет видеть пользователь в информации к обработке
    ПараметрыРегистрации.Вставить("Версия", "1.0");    
    ПараметрыРегистрации.Вставить("Информация", "Отчет по счетам и платежам аренды");
    
    // Создадим таблицу команд (подробнее смотрим ниже)
    ТаблицаКоманд = ПолучитьТаблицуКоманд();
    
    // Добавим команду в таблицу
    ДобавитьКоманду(ТаблицаКоманд, "Реестр договоров", "Реестр договоров", "ОткрытиеФормы", Истина, "ПечатьMXL");
    
    // Сохраним таблицу команд в параметры регистрации обработки
    ПараметрыРегистрации.Вставить("Команды", ТаблицаКоманд);
    
    // Теперь вернем системе наши параметры
    Возврат ПараметрыРегистрации;
	
КонецФункции


Функция ПолучитьТаблицуКоманд()
	
	ТаблицаКоманд = Новый ТаблицаЗначений;
	ТаблицаКоманд.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("Использование", Новый ОписаниеТипов("Строка"));
	ТаблицаКоманд.Колонки.Добавить("ПоказыватьОповещение", Новый ОписаниеТипов("Булево"));
	ТаблицаКоманд.Колонки.Добавить("Модификатор", Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаКоманд;
	
КонецФункции


Процедура ДобавитьКоманду(ТаблицаКоманд, Представление, Идентификатор, Использование, ПоказыватьОповещение = Ложь, Модификатор = "")
	
	НоваяКоманда = ТаблицаКоманд.Добавить();
	НоваяКоманда.Представление = Представление;
	НоваяКоманда.Идентификатор = Идентификатор;
	НоваяКоманда.Использование = Использование;
	НоваяКоманда.ПоказыватьОповещение = ПоказыватьОповещение;
	НоваяКоманда.Модификатор = Модификатор;
	
КонецПроцедуры

Процедура СформироватьОтчетРасшифровка(НастройкиРасшифровки) Экспорт
	
	а=а;
	        //
			//ОтчетРасшифровка = Отчеты.АР_ОтчетПоНачислениям.Создать();
			//Форма = Объект.ПолучитьФорму("ФормаРасшифровка");
			//Форма.Открыть();
			//ОтчетРасшифровка.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
			//ОтчетРасшифровка.СформироватьОтчет();
			//
			
	//МакетСКД = Отчеты.АР_ОтчетПоНачислениям.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	МакетРасшифровка = Отчеты.АР17_ОтчетПоНачислениям.ПолучитьМакет("Расшифровка");
	
	КомпоновщикНастроекРасшифровка = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроекРасшифровка.ЗагрузитьНастройки(МакетРасшифровка.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроекРасшифровка.Настройки;//.ПолучитьНастройки();
	//
	//КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиРасшифровки);
	//Настройки = КомпоновщикНастроек.Настройки;//.ПолучитьНастройки();
	//
	
	
	//ПараметрСКД = МакетСКД.Параметры.Найти("ВидДокумента");  
	//ПараметрСКД.Значение        = "Счета"; //НачалоПериода;  
	//ПараметрСКД.Использование   = ИспользованиеПараметраКомпоновкиДанных.Всегда; 
	//
	////ПараметрСКД = МакетСКД.Параметры.Найти("КонецПериода");  
	////ПараметрСКД.Значение        = КонецПериода;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

	////ПараметрСКД = МакетСКД.Параметры.Найти("Организация");  
	////ПараметрСКД.Значение        = Организация;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

	////МассивГрупп = Новый Массив;
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000120"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000094"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000025"));
	////МассивГрупп.Добавить(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("000000110"));

	////ПараметрСКД = МакетСКД.Параметры.Найти("Группа");  
	////ПараметрСКД.Значение        = МассивГрупп;  
	////ПараметрСКД.Использование    = ИспользованиеПараметраКомпоновкиДанных.Всегда; 

    ДанныеРасшифровкиОтчета = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	// заполняем какие-то параметры
    Настройки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ВидДокумента").Значение; //"Счета";
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаНачало").Значение;
	//Настройки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение = НастройкиРасшифровки.ПараметрыДанных.Элементы.Найти("ДатаКонец").Значение;
	
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(МакетРасшифровка, Настройки, ДанныеРасшифровкиОтчета);
    
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиОтчета);

	//ДокументРезультат = Результат;
	//ДокументРезультат.Очистить(); 
	//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	//ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	//ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//ДокументРезультат.Показать();

КонецПроцедуры
